Revit 2027 API
BuiltInFailures.RebarSystemFailures.AreaReinforcementsCollision Property
 Area Reinforcements are colliding. Aligning the Major Directions, or changing the Additional Offsets, can prevent collision.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AreaReinforcementsCollision { get; }
Public Shared ReadOnly Property AreaReinforcementsCollision As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AreaReinforcementsCollision {
	FailureDefinitionId^ get ();
}
static member AreaReinforcementsCollision : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace